
hello_words = "Привіт! Це гра дешифратор у якій ти маєш вгадати таємничий код з 4 цифр. Спробуй розгадати їх."

rules = ("""Правила гри : 
            Дешифратор — це логічна гра, в якій дешифратор намагається розгадати таємний код, 
            створений кододавцем(програмою). Кододавець(гравець), яким буде виступати програма, яку ми 
            збираємося написати, створює таємний код з чотирьох чисел від 1 до 6. Дешифратор має деяку кількість спроб розгадати код (залежно від обраної складності). На кожному ходу дешифратор робить спробу з 4 чисел. 
            Кододавець позначає спробу до 4 знаками - + або - або порожніми місцями.""")


simple_difficulty_rules = ("При виборі простого рівня ви маєте п'ять спроб щоб вгадати число, та можете використати 3 підказки.")

hard_difficulty_rules = ("При виборі складного рівня, ви маєте три спроби вгадати число, та можете використати 2 підказки")